freshev/micropython/ports/air780/boards/Air780_EG/mpconfigboard.h
#ifndef MICROPY_HW_BOARD_NAME
// Can be set by mpconfigboard.cmake.
#define MICROPY_HW_BOARD_NAME               "Air780 with GPS"
#endif
#define MICROPY_HW_MCU_NAME                 "EC618"

#define NETWORK_FREQ_BAND_1
#define NETWORK_FREQ_BAND_3
#define NETWORK_FREQ_BAND_5
#define NETWORK_FREQ_BAND_8
#define NETWORK_FREQ_BAND_34
#define NETWORK_FREQ_BAND_38
#define NETWORK_FREQ_BAND_39
#define NETWORK_FREQ_BAND_40
#define NETWORK_FREQ_BAND_41

#define GPS_MODULE